DataProcessors/сабПлатежныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>сабПлатежныйКалендарь</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоризонтПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиПоПлатежке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиНаНачало</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВыходные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СворачиватьСтатьиДДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантГруппировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаОстатковПоНеоплаченнымЗаявкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквивалентнаяВалюта</Name>
					<Comment>для проектов с расширенным валютным учетом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьГрафикПоБюджету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьДатуПоследнегоДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/сабГрафикПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>сабГрафикПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСуммаКонтрагента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсКонтрагента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Согласование1ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопПризнак</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредставительскиеРасходы</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДСтрокиБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/сабПлатежныйКалендарь/Forms/ФормаСозданияРеестров/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьРеестр(Команда)
	ТекДанные = Элементы.ОрганизацииТЧ.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И Не ЗначениеЗаполнено(ТекДанные.Реестр) Тогда
		
		МассивДоков = Новый Массив;
		Для каждого ТекСтрока Из ЗаявкиНаОплату Цикл
			Если ТекСтрока.Предприятие = ТекДанные.Предприятие Тогда
				МассивДоков.Добавить(ТекСтрока.ЗаявкаНаОплату);
			КонецЕсли;
		КонецЦикла;
		
		ДанныеТЗ = ПолучитьИзВременногоХранилища(АдресТЗ);
		
		ОткрытьФорму("Документ.Д_ЗаявкаНаОплату.ФормаОбъекта", Новый Структура("Основание", Новый Структура("ДатаГрафика, ВидОплаты, РежимРаботы, ПоказыватьГрафикПоБюджету, МассивДоков, ДанныеТЗ", ТекущаяДата(), Неопределено, РежимРаботы, Ложь, МассивДоков, ДанныеТЗ)), ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты)
  Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
КонецФункции // ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивДоков = Параметры.МассивДоков;
	ДанныеТЗ = Параметры.ДанныеТЗ;
	ДатаГрафика = Параметры.ДатаГрафика;
	ВариантГруппировки = Параметры.ВариантГруппировки;
	РежимРаботы = Параметры.РежимРаботы;
	АдресТЗ = ПоместитьВоВременноеХранилище(Параметры.ДанныеТЗ, ЭтаФорма.УникальныйИдентификатор);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	сабГрафикПлатежей.Документ КАК ЗаявкаНаОплату,
	               |	сабГрафикПлатежей.Предприятие КАК Предприятие,
	               |	сабГрафикПлатежей.ЦФО КАК ЦФО,
	               |	сабГрафикПлатежей.ПодразделениеЦФО КАК ПодразделениеЦФО,
	               |	сабГрафикПлатежей.ДатаПлатежа КАК ДатаПлатежа,
	               |	сабГрафикПлатежей.ВидОперации КАК ВидОперации,
	               |	сабГрафикПлатежей.Источник КАК БанковскийСчет,
	               |	сабГрафикПлатежей.Источник КАК Источник,
	               |	сабГрафикПлатежей.СтатьяДДС КАК СтатьяДДС,
	               |	сабГрафикПлатежей.СтавкаНДС КАК СтавкаНДС,
	               |	сабГрафикПлатежей.Контрагент КАК Контрагент,
	               |	сабГрафикПлатежей.Договор КАК Договор,
	               |	сабГрафикПлатежей.СчетКонтрагента КАК СчетКонтрагента,
	               |	сабГрафикПлатежей.Валюта КАК Валюта,
	               |	сабГрафикПлатежей.УИДСтрокиДокумента КАК УИДСтроки,
	               |	сабГрафикПлатежей.ТочкаМаршрута КАК ТочкаМаршрута,
	               |	сабГрафикПлатежей.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА сабГрафикПлатежей.Сумма < 0
	               |			ТОГДА -сабГрафикПлатежей.Сумма
	               |		ИНАЧЕ сабГрафикПлатежей.Сумма
	               |	КОНЕЦ КАК СуммаПлатежа,
	               |	ВЫБОР
	               |		КОГДА сабГрафикПлатежей.СуммаНДС < 0
	               |			ТОГДА -сабГрафикПлатежей.СуммаНДС
	               |		ИНАЧЕ сабГрафикПлатежей.СуммаНДС
	               |	КОНЕЦ КАК СуммаНДС,
	               |	ВЫБОР
	               |		КОГДА сабГрафикПлатежей.СуммаНДС < 0
	               |			ТОГДА -сабГрафикПлатежей.СуммаНДС
	               |		ИНАЧЕ сабГрафикПлатежей.СуммаНДС
	               |	КОНЕЦ КАК СуммаНДСАвтоматическийРасчет,
	               |	ВЫБОР
	               |		КОГДА сабГрафикПлатежей.ВалютнаяСумма < 0
	               |			ТОГДА -сабГрафикПлатежей.ВалютнаяСумма
	               |		ИНАЧЕ сабГрафикПлатежей.ВалютнаяСумма
	               |	КОНЕЦ КАК ВалютнаяСумма,
	               |	сабГрафикПлатежей.Курс КАК Курс,
	               |	сабГрафикПлатежей.НазначениеПлатежа КАК НазначениеПлатежаБух,
	               |	сабГрафикПлатежей.НазначениеПлатежаУчет КАК НазначениеПлатежа,
	               |	сабГрафикПлатежей.Комментарий КАК Примечание,
	               |	1 КАК Количество
	               |ИЗ
	               |	РегистрСведений.сабГрафикПлатежей КАК сабГрафикПлатежей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Д_ЗаявкаНаОплату.ЗаявкаБезнал КАК Д_ЗаявкаНаОплатуЗаявкаБезнал
	               |		ПО сабГрафикПлатежей.Документ = Д_ЗаявкаНаОплатуЗаявкаБезнал.ЗаявкаНаФинансирование
	               |			И (Д_ЗаявкаНаОплатуЗаявкаБезнал.Ссылка.ПометкаУдаления = ЛОЖЬ)
	               |			И сабГрафикПлатежей.УИДСтрокиДокумента = Д_ЗаявкаНаОплатуЗаявкаБезнал.УИДСтроки
	               |ГДЕ
	               |	сабГрафикПлатежей.ДатаПлатежа <= &ДатаПлатежа
	               |	И (ТИПЗНАЧЕНИЯ(сабГрафикПлатежей.Документ) = ТИП(Документ.Д_ЗаявкаНаФинансирование)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(сабГрафикПлатежей.Документ) = ТИП(Документ.Д_Бюджет))
	               |	И Д_ЗаявкаНаОплатуЗаявкаБезнал.Ссылка ЕСТЬ NULL
	               |	И сабГрафикПлатежей.Предприятие В ИЕРАРХИИ(&ДоступныеПредприятия)
	               |	И сабГрафикПлатежей.ОснованиеПометкаУдаления = ЛОЖЬ
	               |	И сабГрафикПлатежей.Документ.ПометкаУдаления = ЛОЖЬ
	               |	И (сабГрафикПлатежей.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
	               |			ИЛИ &ПоказыватьГрафикПоБюджету)
	               |	И ВЫБОР
	               |			КОГДА НЕОПРЕДЕЛЕНО В (&МассивДоков)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ сабГрафикПлатежей.Документ В (&МассивДоков)
	               |		КОНЕЦ
	               |	И сабГрафикПлатежей.ВидОперации В(&ВидыОперацийРасходов)
	               |	И (сабГрафикПлатежей.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
	               |			ИЛИ сабГрафикПлатежей.Сценарий = &СценарийФакт)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Предприятие,
	               |	Источник
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаПлатежа", КонецДня(ДатаГрафика));
	//Запрос.УстановитьПараметр("ТипИсточника", ТипИсточника);
	//Запрос.УстановитьПараметр("РежимОплаты", ДанныеЗаполнения.РежимРаботы);
	Запрос.УстановитьПараметр("ПоказыватьГрафикПоБюджету", Ложь);
	Запрос.УстановитьПараметр("ДоступныеПредприятия", ПараметрыСеанса.ДоступныеПредприятия);
	Запрос.УстановитьПараметр("МассивДоков", ?(МассивДоков.Количество(), МассивДоков, Неопределено));
	Запрос.УстановитьПараметр("ВидыОперацийРасходов", ПП_Сервер.ЭтоРасходнаяОперация());
	Запрос.УстановитьПараметр("СценарийФакт", Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивПредприятий = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЗаявкиНаОплату.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка.ЗаявкаНаОплату);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	ТЧОрг = ЗаявкиНаОплату.Выгрузить();
	ТЧОрг.Свернуть("Предприятие", "СуммаПлатежа, Количество");
	ОрганизацииТЧ.Загрузить(ТЧОрг);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииТЧПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ОрганизацииТЧ.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		Элементы.ЗаявкиНаОплату.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Предприятие", ТекДанные.Предприятие));
	Иначе
		Элементы.ЗаявкиНаОплату.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Предприятие", Неопределено));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("сабОбноватьПлатежныйКалендарь");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "сабОбноватьПлатежныйКалендарь" Тогда
		ТекДанные = Элементы.ОрганизацииТЧ.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда
			ТекДанные.Реестр = Источник;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииТЧВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ОрганизацииТЧ.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ЗначениеЗаполнено(ТекДанные.Реестр) Тогда
		ПоказатьЗначение(, ТекДанные.Реестр);
	КонецЕсли;
КонецПроцедуры
